//Задача 2: Напишите программу, которая на вход принимает два числа и выдает, какое число больше, а какое меньше.
//Задаем входящие переменные: 
int a = -5;
int b = 2;
int max = 0;
//Вычесление: 
if (a > b)
{
    max = a;
}
else 
{
    max = b;
}
Console.WriteLine(max);


