// Задача: 6 Напишите программу, которая на вход принимает число и выдает, являеться ли число четным( делиться ли оно на два без остатка).
//Задаем входящие переменные: 
 int a = -8;
 string result;
 // Решение
if ((a % 2) == 0) { 

result = "Да";

   } else {

result = "Нет";

}
Console.WriteLine(result);

 





Console.WriteLine("Hello, World!");
