// Напишите программу, которая на вход принимает число  (N), а на выходе показывает все четные от 1 до N.
//Задаем входящие переменные:
int n = 15;
int a = 1;
//Решение:
while (a <= n) {

if ((a % 2) == 0){
    Console.WriteLine(a); 
}
    a++; 
}


